In [1]:
%load_ext sql
%sql sqlite://
%sql sqlite:///database.db

u'Connected: None@database.db'

# Show the restaruant table

In [237]:
%sql select * from restaurant limit 2

Done.

[(0, u'The Purple Pig', 4.0, u'https//www.yelp.com/biz/the-purple-pig-chicago?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw', u'$$', 4939, u'(312) 464-1744', u'https://s3-media4.fl.yelpcdn.com/bphoto/_A9av72FoUEpGnf1WR7hIg/o.jpg', 0),
 (1, u'Au Cheval', 4.5, u'https//www.yelp.com/biz/au-cheval-chicago?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw', u'$$', 3794, u'(312) 929-4580', u'https://s3-media4.fl.yelpcdn.com/bphoto/o7P1jZ8tMz5q8CYrcRrGbA/o.jpg', 1)]

# show the address table

In [9]:
%sql select * from address limit 1

Done.

[(0, u'500 N Michigan Ave', u'Chicago', 60611)]

# show the belong_to relational table

In [13]:
%sql select * from belong_to limit 1

Done.

[(60611, 0)]

# show the restaruant_by_category relational table

In [18]:
%sql select * from restaurant_by_category limit 1

Done.

[(0, 0)]

# show the category table

In [17]:
%sql select * from category limit 1

Done.

[(0, u'Tapas/Small Plates')]

# create trigger when insert a new restaurant if the ID already exist then report.

In [245]:
%%sql
CREATE TRIGGER IF NOT EXISTS inserrestaurant
BEFORE INSERT ON restaurant
FOR EACH ROW
WHEN(EXISTS (SELECT * FROM restaurant
            WHERE NEW.id=id))
BEGIN 
    SELECT RAISE(ABORT, 'ID exists');
END;

Done.

[]

# create trigger when insert a new address if the ID already exist then report.

In [247]:
%%sql
CREATE TRIGGER IF NOT EXISTS insertAddress
BEFORE INSERT ON address
FOR EACH ROW
WHEN(EXISTS (SELECT * FROM address WHERE NEW.addressID=addressID))
BEGIN
    SELECT RAISE(ABORT, 'address exists');
END;

Done.

[]

# insert a new record into restaurant and address table

In [254]:
%%sql
insert into restaurant(name, rating, url, price, review_count, image_url, addressID) values ('Sawa Sushi','www.sawasushi.com',4.5,'$$$$',196,"Null",'384');
insert into address values(384,'1042 E El Camino Real','Sunnyvale',94087);

1 rows affected.
1 rows affected.

[]

# searching restaurant by name from restaurant table

In [256]:
%%sql
select id, name, phone, rating from restaurant where name LIKE '%Bird Provisions%'

Done.

[(273, u'State Bird Provisions', u'(415) 795-1272', 4.0)]

# searching restaurant by zip_code from restaurant and address table

In [25]:
%%sql
SELECT r.id, r.name,r.phone, r.rating , a.street, a.city, a.zip_code 
FROM restaurant r, address a 
WHERE r.addressID=a.addressID AND a.zip_code= 94115
order by rating

Done.

[(380, u'SPQR', u'(415) 771-7779', 3.5, u'1911 Fillmore St', u'San Francisco', 94115),
 (273, u'State Bird Provisions', u'(415) 795-1272', 4.0, u'1529 Fillmore St', u'San Francisco', 94115),
 (354, u'Nico', u'(415) 359-1000', 4.0, u'3228 Sacramento St', u'San Francisco', 94115),
 (366, u'The Progress', u'(415) 673-1294', 4.0, u'1525 Fillmore St', u'San Francisco', 94115),
 (322, u'Mosu', u'(415) 735-7303', 4.5, u'1552 Fillmore St', u'San Francisco', 94115)]

# Searching restaurant and the address by partical name of restaurant

In [29]:
%%sql
SELECT r.id, r.name,r.phone, r.rating , a.street, a.city, a.zip_code 
FROM restaurant r, address a 
WHERE r.addressID=a.addressID AND r.name LIKE '%dowsweet%'

Done.

[(200, u'Meadowsweet', u'(718) 384-0673', 4.0, u'149 Broadway', u'Brooklyn', 11211)]

# searching restaurant and address by city and rating>4.5

In [56]:
%%sql
SELECT r.name, r.phone, r.rating, a.street, a.city,a.zip_code
FROM restaurant r, address a
WHERE r.addressID=a.addressID AND a.city='Chicago' AND rating >4.5
order by price

Done.

[(u'Oriole', u'(312) 877-5339', 5.0, u'661 W Walnut St', u'Chicago', 60661)]

# searching restaurant and address by city (with lower case letter) and rating = 5

In [38]:
%%sql
SELECT r.name,  r.phone, r.rating, a.street, a.city,a.zip_code
FROM restaurant r, address a
WHERE r.addressID=a.addressID AND rating=5 AND UPPER(city)= UPPER('new york')

Done.

[(u"L'Appart", u'(212) 981-8577', 5.0, u'225 Liberty St', u'New York', 10281)]

# searching restaurant and address by street.

In [43]:
%%sql
SELECT r.name,r.phone, r.rating,a.street, a.city, a.zip_code
FROM restaurant r, address a
WHERE r.addressID=a.addressID and UPPER (street) LIKE UPPER('%Grand St%')

Done.

[(u'Nyonya', u'(212) 334-3669', 4.0, u'199 Grand St', u'New York', 10013),
 (u'Aurora', u'(718) 388-5100', 4.0, u'70 Grand St', u'Brooklyn', 11249),
 (u'The Saint Austere', u'(718) 388-0012', 4.5, u'613 Grand St', u'Brooklyn', 11211)]

# searching restaurant and address by street and city.

In [44]:
%%sql
SELECT r.name,r.phone, r.rating,a.street, a.city, a.zip_code
FROM restaurant r, address a
WHERE r.addressID=a.addressID and UPPER (street) LIKE UPPER('%Grand St%') and city="Brooklyn"

Done.

[(u'Aurora', u'(718) 388-5100', 4.0, u'70 Grand St', u'Brooklyn', 11249),
 (u'The Saint Austere', u'(718) 388-0012', 4.5, u'613 Grand St', u'Brooklyn', 11211)]

# searching restaurant and address by street, city and rating >= 4.5

In [46]:
%%sql
SELECT r.name,r.phone, r.rating,a.street, a.city, a.zip_code
FROM restaurant r, address a
WHERE r.addressID=a.addressID and UPPER (street) LIKE UPPER('%Grand St%') and city="Brooklyn" and rating>=4.5

Done.

[(u'The Saint Austere', u'(718) 388-0012', 4.5, u'613 Grand St', u'Brooklyn', 11211)]

# searching restaurant and address by zip_code and rating>= 4, sort by price.

In [54]:
%%sql
SELECT r.name, r.phone, a.street, a.city
From restaurant r, address a
WHERE r.addressID = a.addressID and zip_code =94115 and rating>=4
ORDER BY price DESC

Done.

[(u'Mosu', u'(415) 735-7303', u'1552 Fillmore St', u'San Francisco'),
 (u'The Progress', u'(415) 673-1294', u'1525 Fillmore St', u'San Francisco'),
 (u'State Bird Provisions', u'(415) 795-1272', u'1529 Fillmore St', u'San Francisco'),
 (u'Nico', u'(415) 359-1000', u'3228 Sacramento St', u'San Francisco')]

# searching restaurant and address by city and review_count>2200 then sort by rating and price.

In [69]:
%%sql
select r.id, r.name, r.phone, r.rating, a.street,r.url,r.price
from restaurant r, address a
where r.addressID = a.addressID and upper(city)=upper('new york') and review_count>2200 
order by rating, price

Done.

[(133, u"Joe's Shanghai", u'(212) 233-8888', 4.0, u'9 Pell St', u'https//www.yelp.com/biz/joes-shanghai-new-york-2?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw', u'$$'),
 (153, u'ABC Kitchen', u'(212) 475-5829', 4.0, u'35 E 18th St', u'https//www.yelp.com/biz/abc-kitchen-new-york?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw', u'$$$'),
 (238, u'The Stanton Social', u'(212) 995-0099', 4.0, u'99 Stanton St', u'https//www.yelp.com/biz/the-stanton-social-new-york?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw', u'$$$'),
 (136, u'Gramercy Tavern', u'(212) 477-0777', 4.5, u'42 E 20th St', u'https//www.yelp.com/biz/gramercy-tavern-new-york?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw', u'$$$$')]

# searching restaurant and address by rating>=4.5, review_count>2000, and zip_code in california then sort results by rating and price.

In [93]:
%%sql
select r.id, r.name, r.phone, r.rating, a.street,a.city,r.price
from restaurant r, address a
where r.addressID = a.addressID and rating >=4.5 and review_count>2000 
and a.zip_code IN(
     select b.zip_code 
     from state s, belong_to b
    where s.stateID=b.state_id and upper(s.statename) =upper('california'))
order by rating, price

Done.

[(294, u'Kokkari Estiatorio', u'(415) 981-0983', 4.5, u'200 Jackson St', u'San Francisco', u'$$$'),
 (353, u'Chapeau!', u'(415) 750-9787', 4.5, u'126 Clement St', u'San Francisco', u'$$$'),
 (274, u'Gary Danko', u'(415) 749-2060', 4.5, u'800 N Point St', u'San Francisco', u'$$$$')]

# searching restaurant and it's category by restaurant name.

In [100]:
%%sql
SELECT r.id,r.name,r.phone, r.rating, c.title
from restaurant r, category c, restaurant_by_category rc
where r.id=rc.restaurant_id and rc.category_id=c.id and r.name like '%Antique Taco%'

Done.

[(49, u'Antique Taco', u'(773) 823-9410', 3.5, u'Desserts'),
 (49, u'Antique Taco', u'(773) 823-9410', 3.5, u'Bars'),
 (68, u'Antique Taco', u'(773) 687-8697', 4.0, u'Beer Bar'),
 (68, u'Antique Taco', u'(773) 687-8697', 4.0, u'Lounges')]

# Excute all restaurants with their category title which having more than three different category.

In [6]:
%%sql
SELECT r.id,r.name,r.phone, r.rating, count(*) as categorycount
from restaurant r, category c, restaurant_by_category rc
where r.id=rc.restaurant_id and rc.category_id=c.id 
group by r.name
having count(distinct c.title)>3
order by count(*)

Done.

[(68, u'Antique Taco', u'(773) 687-8697', 4.0, 4),
 (89, u'Rojo Gusano', u'(773) 539-4398', 4.0, 4),
 (87, u'The Angry Crab', u'(773) 687-9929', 3.5, 6)]

# searching restaurant and address by city and category title sort results by price.

In [107]:
%%sql 
SELECT r.id,r.name,r.phone, r.rating, c.title, a.street, a.city,r.price
from restaurant r, category c, restaurant_by_category rc, address a
where r.id=rc.restaurant_id and rc.category_id=c.id and r.addressID = a.addressID 
and city='New York' and c.title='Burgers'
order by price

Done.

[(251, u'Cafe Sabarsky', u'(212) 288-0665', 4.0, u'Burgers', u'1048 5th Ave', u'New York', u'$$'),
 (179, u'Schilling', u'(212) 406-1200', 4.5, u'Burgers', u'109 Washington St', u'New York', u'$$$')]

# searching all restaurants and their address in Illinois which supply breakfast & brunch and rating more than 4.5

In [126]:
%%sql
select  r.id, r.name, r.phone, r.rating, c.title, a.street, a.city,r.price
from restaurant r, category c, restaurant_by_category rc, address a
where r.id=rc.restaurant_id and rc.category_id=c.id and r.addressID = a.addressID and c.title='Breakfast & Brunch'and rating>=4.5
and  a.zip_code In(select b.zip_code
            from belong_to b, state s
            where s.stateID=b.state_id and s.statename='Illinois')

Done.

[(5, u"Bavette's Bar & Boeuf", u'(312) 624-8154', 4.5, u'Breakfast & Brunch', u'218 W Kinzie St', u'Chicago', u'$$$'),
 (8, u'Avec', u'(312) 377-2002', 4.5, u'Breakfast & Brunch', u'615 W Randolph St', u'Chicago', u'$$$')]

# searching all restaurants and their address in New York city which supply burgers or tapas and rating over 4.

In [129]:
%%sql 
SELECT r.id,r.name,r.phone, r.rating, c.title, a.street, a.city,r.price
from restaurant r, category c, restaurant_by_category rc, address a
where r.id=rc.restaurant_id and rc.category_id=c.id and r.addressID = a.addressID 
and city='New York' and (c.title='Burgers'or upper(c.title)  like upper('%Tapas%')) and rating >4
order by price

Done.

[(168, u'Covina', u'(212) 204-0225', 4.5, u'Tapas/Small Plates', u'127 E 27th St', u'New York', u'$$$'),
 (179, u'Schilling', u'(212) 406-1200', 4.5, u'Burgers', u'109 Washington St', u'New York', u'$$$'),
 (179, u'Schilling', u'(212) 406-1200', 4.5, u'Tapas/Small Plates', u'109 Washington St', u'New York', u'$$$'),
 (231, u'The Eddy', u'(646) 895-9884', 4.5, u'Tapas/Small Plates', u'342 E 6th St', u'New York', u'$$$'),
 (268, u'Wallflower', u'(646) 682-9842', 4.5, u'Tapas/Small Plates', u'235 W 12th St', u'New York', u'$$$'),
 (136, u'Gramercy Tavern', u'(212) 477-0777', 4.5, u'Tapas/Small Plates', u'42 E 20th St', u'New York', u'$$$$')]

# searching all restaurants in New York city with over 2000 review count which their category only supply by the restaurants.

In [140]:
%%sql
select  c.title, r.name, r.phone, r.rating, r.url
from restaurant r, category c, restaurant_by_category rc, address a
where r.id=rc.restaurant_id and rc.category_id=c.id and r.addressID=a.addressID and a.city="New York"and review_count>2000
group by c.title
having count(*) =1
order by rating DESC

Done.

[(u'American Traditional)', u'Babbo', u'(212) 777-0303', 4.0, u'https//www.yelp.com/biz/babbo-new-york?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw'),
 (u'Austrian', u'Babbo', u'(212) 777-0303', 4.0, u'https//www.yelp.com/biz/babbo-new-york?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw'),
 (u'Cafes', u'The Stanton Social', u'(212) 995-0099', 4.0, u'https//www.yelp.com/biz/the-stanton-social-new-york?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw'),
 (u'Japanese', u"Joe's Shanghai", u'(212) 233-8888', 4.0, u'https//www.yelp.com/biz/joes-shanghai-new-york-2?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw'),
 (u'Latin American', u'ABC Kitchen', u'(212) 475-5829', 4.0, u'https//www.yelp.com/biz/abc-kitchen-new-york?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw'),
 (u'Pubs', u'Becco', u'(212) 397-7597', 4.0, u'https//www.yelp.com/biz/becco-new-york-4?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw'),
 (u'Seafood', u'The Stanton Social', u'(212) 995-0099', 4.0, u'https//www.yelp.com/biz/the-stanton-social-new-york?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw'),
 (u'Tacos', u'The Stanton Social', u'(212) 995-0099', 4.0, u'https//www.yelp.com/biz/the-stanton-social-new-york?adjust_creative=TgDi75JA_PwGLZfvhAmGyw&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=TgDi75JA_PwGLZfvhAmGyw')]

# searching restaurant and address with category title, burgers or tapas, which has most review count.

In [153]:
%%sql 
SELECT distinct r.id,r.name,r.phone, r.rating, c.title, a.street, a.city,r.price
from restaurant r, category c, restaurant_by_category rc, address a
where r.id=rc.restaurant_id and rc.category_id=c.id and r.addressID = a.addressID 
and (c.title='Burgers'or upper(c.title)  like upper('%Tapas%')) 
and review_count = (
    select max(r1.review_count)
    from restaurant r1, category c1, restaurant_by_category rc1
    where r1.id=rc1.restaurant_id and rc1.category_id=c1.id and (c1.title='Burgers'or upper(c1.title)  like upper('%Tapas%')))

Done.

[(0, u'The Purple Pig', u'(312) 464-1744', 4.0, u'Tapas/Small Plates', u'500 N Michigan Ave', u'Chicago', u'$$')]

# searching restaurant and address with category title, burgers or tapas, which has most review count.

In [157]:
%%sql 
SELECT r.id,r.name,r.phone, r.rating, c.title, a.street, a.city,r.price
from restaurant r, category c, restaurant_by_category rc, address a
where r.id=rc.restaurant_id and rc.category_id=c.id and r.addressID = a.addressID 
and (c.title='Burgers'or upper(c.title)  like upper('%Tapas%')) 
order by review_count DESC
LIMIT 1

Done.

[(0, u'The Purple Pig', u'(312) 464-1744', 4.0, u'Tapas/Small Plates', u'500 N Michigan Ave', u'Chicago', u'$$')]

# searching restaurant and address with category title is breakfast & brunch and rating over 4.5, which has most review count.

In [171]:
%%sql
select r.id, r.name, r.phone, r.rating, c.title, a.street, a.city,r.price,r.review_count
from restaurant r, category c, restaurant_by_category rc, address a
where r.id=rc.restaurant_id and rc.category_id=c.id and r.addressID = a.addressID
and c.title='Breakfast & Brunch' and rating >=4.5
and r.review_count=(select max(review_count)
                    from restaurant r, category c, restaurant_by_category rc
    where r.id=rc.restaurant_id and rc.category_id=c.id and c.title='Breakfast & Brunch' and rating>=4.5)

Done.

[(8, u'Avec', u'(312) 377-2002', 4.5, u'Breakfast & Brunch', u'615 W Randolph St', u'Chicago', u'$$$', 1766)]

# searching restaurant and its address which zip_code belong to California, category is "Breakfast & Brunch" and  have higest rating

In [175]:
%%sql
select  r.id, r.name, r.phone, r.rating, c.title, a.street, a.city,r.price
from restaurant r, category c, restaurant_by_category rc, address a
where r.id=rc.restaurant_id and rc.category_id=c.id and r.addressID = a.addressID and c.title='Breakfast & Brunch'
and  a.zip_code In(select b.zip_code
            from belong_to b, state s
            where s.stateID=b.state_id and s.statename='California') 
order by rating DESC
limit 1

Done.

[(358, u'Piperade', u'(415) 391-2555', 4.0, u'Breakfast & Brunch', u'1015 Battery St', u'San Francisco', u'$$$')]

# searching restaurant and its address which zip_code belong to California and  have higest review count

In [177]:
%%sql
select  r.id, r.name, r.phone, r.rating, c.title, a.street, a.city,r.price,review_count
from restaurant r, category c, restaurant_by_category rc, address a
where r.id=rc.restaurant_id and rc.category_id=c.id and r.addressID = a.addressID
and  a.zip_code In(select b.zip_code
            from belong_to b, state s
            where s.stateID=b.state_id and s.statename='California') 
order by review_count DESC
limit 1

Done.

[(275, u'Burma Superstar', u'(415) 387-2147', 4.0, u'Basque', u'309 Clement St', u'San Francisco', u'$$', 5676)]

# searching the restaurant and its address which zip_code belong to New York state and have rating =5

In [179]:
%%sql
select  r.id, r.name, r.phone, r.rating, c.title, a.street, a.city,r.price,review_count
from restaurant r, category c, restaurant_by_category rc, address a
where r.id=rc.restaurant_id and rc.category_id=c.id and r.addressID = a.addressID and rating =5
and  a.zip_code In(select b.zip_code
            from belong_to b, state s
            where s.stateID=b.state_id and s.statename='New York')

Done.

[(250, u"L'Appart", u'(212) 981-8577', 5.0, u'Beer Bar', u'225 Liberty St', u'New York', u'$$$$', 35)]

# searching restaurant and its reviews by partical restaurant name "Meadow" and order result by review rating

In [185]:
%%sql
select r.id, r.name ,r.price, re.time,re.rating,re.text
from restaurant r, review re
where r.id=re.restaurant_id and r.name LIKE '%Meadow%'
ORDER BY re.rating

Done.

[(200, u'Meadowsweet', u'$$$', u'2017-04-21 093320', 4.0, u"Awesome brunch spot in Williamsburg, highly recommended.\n\nThe waffles looked great topped with fresh berries, whipped cream, and maple syrup, but we didn't..."),
 (200, u'Meadowsweet', u'$$$', u'2017-04-02 151813', 5.0, u'Walked in around 230ish for Sunday brunch. Though the restaurant was full we walked in just as another couple was getting ready to leave. The hostesses and...'),
 (200, u'Meadowsweet', u'$$$', u'2017-03-21 070154', 5.0, u'i randomly happened upon this spot when i was searching for a resto that would take brunch reservations for a large party. i think eater.com led me...')]

# searching restaurants and their review in Astoria which category is "Gastropubs" then sort result by review rating.

In [192]:
%%sql
select r.name, r.phone, r.price, re.rating, re.text
from restaurant r, review re, address a, category c, restaurant_by_category rc
where r.id=re.restaurant_id and r.id=rc.restaurant_id and rc.category_id=c.id and r.addressID = a.addressID and 
c.title='Gastropubs' and a.city='Astoria'
order by re.rating

Done.

[(u'Gastroteca', u'(718) 729-9080', u'$$', 3.0, u'Came here on a Saturday @ 1145 we were seated but told we had until 1 to eat. It is better if you make a reservation. It fills up quickly here.\n\nGood...'),
 (u'Gastroteca', u'(718) 729-9080', u'$$', 4.0, u'Very nice place near Kaufman studios and The Museum of the Moving Image.  Inside was airy and very bright.  \n\nI had the chicken and waffles (as good as...'),
 (u'Gastroteca', u'(718) 729-9080', u'$$', 5.0, u"The drinks here are STRONG. I came for brunch and had a shandy followed by two Moscow Mules and was definitely feeling the after effects, so don't let the...")]

# searching restaurants and their reviews which reviewed by reviewer named "Brent W."

In [200]:
%%sql
select r.name,r.phone, c.title, re.rating, re.text
from restaurant r, review re, category c, restaurant_by_category rc
where r.id=re.restaurant_id and r.id=rc.restaurant_id and rc.category_id=c.id and re.name='Brent W.'

Done.

[(u'The Dawson', u'(312) 243-8955', u'Cocktail Bars', 4.0, u'The Dawson is pretty solid all the way around. Came here late to the party and am happy to say, they still deliver.  Great space, concept, look and feel,...'),
 (u'The Dawson', u'(312) 243-8955', u'Wine Bars', 4.0, u'The Dawson is pretty solid all the way around. Came here late to the party and am happy to say, they still deliver.  Great space, concept, look and feel,...'),
 (u'The Dawson', u'(312) 243-8955', u'Latin American', 4.0, u'The Dawson is pretty solid all the way around. Came here late to the party and am happy to say, they still deliver.  Great space, concept, look and feel,...'),
 (u'Owen & Engine', u'(773) 235-2930', u'Seafood', 4.0, u'This place strikes me as a proper English Pub with a smallish space but it works, quite cozy and nice.  The atmo, beer, food, and service - all excellent....'),
 (u'Owen & Engine', u'(773) 235-2930', u'Whiskey Bars', 4.0, u'This place strikes me as a proper English Pub with a smallish space but it works, quite cozy and nice.  The atmo, beer, food, and service - all excellent....'),
 (u'The Radler', u'(773) 276-0270', u'Breweries', 4.0, u"Caveat Lector, I'm gonna talk thru some completely unrelated shiii for about a few good seconds so hold tight.\n\nFirst off i ended up in the equivalent of a..."),
 (u'The Radler', u'(773) 276-0270', u'Cajun/Creole', 4.0, u"Caveat Lector, I'm gonna talk thru some completely unrelated shiii for about a few good seconds so hold tight.\n\nFirst off i ended up in the equivalent of a..."),
 (u'The Radler', u'(773) 276-0270', u'American Traditional)', 4.0, u"Caveat Lector, I'm gonna talk thru some completely unrelated shiii for about a few good seconds so hold tight.\n\nFirst off i ended up in the equivalent of a...")]

# searching the reviewer who reviews restaurants at more than three cities.

In [231]:
%%sql
select re.name as review_by
from restaurant r, review re, category c, restaurant_by_category rc, address a
where r.id=re.restaurant_id and r.id=rc.restaurant_id and rc.category_id=c.id and a.addressID=r.addressID  
group by re.name
having count(distinct a.city) >=3

Done.

[(u'Stephanie Y.',), (u'Tiffany H.',)]

# searching restaurant and its reviews in Chicago and have rating = 5

In [4]:
%%sql
select r.id, r.name,r.phone, c.title, re.text,a.city, re.name as review_by
from restaurant r, review re, category c, restaurant_by_category rc, address a
where r.id=re.restaurant_id and r.id=rc.restaurant_id and rc.category_id=c.id and a.addressID=r.addressID 
and r.rating=5 and a.city='Chicago'

Done.

[(26, u'Oriole', u'(312) 877-5339', u'Tapas/Small Plates', u'I came here with my husband for my birthday. Firstly, the service was excellent, staff was friendly. My servers were very knowledgeable, and I got a...', u'Chicago', u'Nikhila B.'),
 (26, u'Oriole', u'(312) 877-5339', u'Tapas/Small Plates', u'I cannot possibly explain enough how truly magical of an experience we had at Oriole. Chef Noah Sandoval and Chef Genie Kwon are truly master artists in...', u'Chicago', u'Raheleh K.'),
 (26, u'Oriole', u'(312) 877-5339', u'Tapas/Small Plates', u"I haven't been to a prixe fixe in awhile so I was looking forward to this for a friends bday.  \n\nThe location-you have to be looking for it to find...", u'Chicago', u'Stephanie L.')]

# searching restaurant and its review in San Francisco by reviewer named "Tiffany H."

In [221]:
%%sql
select r.id, r.name,r.phone, c.title, re.rating, re.text,a.city, re.name as review_by
from restaurant r, review re, category c, restaurant_by_category rc, address a
where r.id=re.restaurant_id and r.id=rc.restaurant_id and rc.category_id=c.id and a.addressID=r.addressID 
and re.name='Tiffany H.' and city='San Francisco'

Done.

[(278, u'Kin Khao', u'(415) 362-7456', u'Filipino', 5.0, u'Kin Khao is definitely one of the best Thai restaurants I have been to! Highlights of my visit included the Butternut Squash Curry, the Pork Belly, and the...', u'San Francisco', u'Tiffany H.')]

# searching restaurants and their reviews by reviewer named "Stephanie Y." which the reviewer gives the highest rating.

In [232]:
%%sql
select r.id, r.name,r.phone, c.title, re.rating, re.text,a.city, re.name as review_by
from restaurant r, review re, category c, restaurant_by_category rc, address a
where r.id=re.restaurant_id and r.id=rc.restaurant_id and rc.category_id=c.id and a.addressID=r.addressID 
and  re.name='Stephanie Y.' 
and re.rating=(select max(rating) from review where name='Stephanie Y.')

Done.

[(217, u'Emily', u'(347) 844-9588', u'Sandwiches', 4.0, u'Really really delicious pizza. Note. You can take out pizza. Also note by 8pm on a Saturday they were out of their limited count burger. Womp womp. Come...', u'Brooklyn', u'Stephanie Y.'),
 (266, u'Little Pepper', u'(718) 939-7788', u'Bakeries', 4.0, u"It's hard to get me to ever rate Sichuan food badly. If it's authentically salty and spicy, I'm all about it. Little Pepper's gotta be REAL up your alley if...", u'College Point', u'Stephanie Y.')]

# searching the restaurants and their review which review by some reviewer who review restaurants in more than three city then sort the result by reviewer name and rating.

In [241]:
%%sql 
select r.id, r.name,r.phone, c.title, re.rating, re.text,a.city, re.name as review_by
from restaurant r, review re, category c, restaurant_by_category rc, address a
where r.id=re.restaurant_id and r.id=rc.restaurant_id and rc.category_id=c.id and a.addressID=r.addressID 
and  re.name IN (select re.name 
from restaurant r, review re, category c, restaurant_by_category rc, address a
where r.id=re.restaurant_id and r.id=rc.restaurant_id and rc.category_id=c.id and a.addressID=r.addressID  
group by re.name
having count(distinct a.city) >=3
)
order by re.name,re.rating

Done.

[(340, u'Zuni Caf\xe9', u'(415) 552-2522', u'Tapas/Small Plates', 3.0, u"I guess it was A-OK? I mean from the rave reviews as this being known as an iconic SF spot, I gotta say not super impressed. It's a nice central location...", u'San Francisco', u'Stephanie Y.'),
 (340, u'Zuni Caf\xe9', u'(415) 552-2522', u'Diners', 3.0, u"I guess it was A-OK? I mean from the rave reviews as this being known as an iconic SF spot, I gotta say not super impressed. It's a nice central location...", u'San Francisco', u'Stephanie Y.'),
 (340, u'Zuni Caf\xe9', u'(415) 552-2522', u'Tacos', 3.0, u"I guess it was A-OK? I mean from the rave reviews as this being known as an iconic SF spot, I gotta say not super impressed. It's a nice central location...", u'San Francisco', u'Stephanie Y.'),
 (217, u'Emily', u'(347) 844-9588', u'Sandwiches', 4.0, u'Really really delicious pizza. Note. You can take out pizza. Also note by 8pm on a Saturday they were out of their limited count burger. Womp womp. Come...', u'Brooklyn', u'Stephanie Y.'),
 (266, u'Little Pepper', u'(718) 939-7788', u'Bakeries', 4.0, u"It's hard to get me to ever rate Sichuan food badly. If it's authentically salty and spicy, I'm all about it. Little Pepper's gotta be REAL up your alley if...", u'College Point', u'Stephanie Y.'),
 (23, u'Smoque BBQ', u'(773) 545-7427', u'American New)', 2.0, u"Hmmm..I'm disappointed by Midwest 'Que! When there aren't paper towels on the table, you already know that it's just going to be ok. \n\nWhen we arrived,...", u'Chicago', u'Tiffany H.'),
 (207, u'La Vara', u'(718) 422-0065', u'Soup', 4.0, u'Came here for brunch with some diehard foodies who claimed this is one of their favorite restaurants in all of NYC for dinner - one was getting ready to...', u'Brooklyn', u'Tiffany H.'),
 (119, u'Ramen Takeya', u'(312) 666-7710', u'Peruvian', 5.0, u"Ugh, I'm so ramen deprived in IN so I was really excited to stop by Ramen Takeya and Ramen Takeya did not disappoint. \n\nI had the Spicy Chicken Paitan (Cage...", u'Chicago', u'Tiffany H.'),
 (119, u'Ramen Takeya', u'(312) 666-7710', u'Breweries', 5.0, u"Ugh, I'm so ramen deprived in IN so I was really excited to stop by Ramen Takeya and Ramen Takeya did not disappoint. \n\nI had the Spicy Chicken Paitan (Cage...", u'Chicago', u'Tiffany H.'),
 (278, u'Kin Khao', u'(415) 362-7456', u'Filipino', 5.0, u'Kin Khao is definitely one of the best Thai restaurants I have been to! Highlights of my visit included the Butternut Squash Curry, the Pork Belly, and the...', u'San Francisco', u'Tiffany H.')]